taurus/security_test/security_test2.yml
execution:
- executor: gatling
  concurrency: 100
  ramp-up: 10s
  hold-for: 30s
  scenario:
    script: health.scala
    simulation: src.test.taurus.security_test.BasicSimulation
    keepalive: true

# http://gettaurus.org/docs/ScenarioBuilding/

reporting:
  - module: final-stats
    dump-xml: security-test-health-scala-stats.xml