taurus/security_test/security_test3_jmeter.yml
execution:
- executor: jmeter
  concurrency: 10
  ramp-up: 5s
  hold-for: 5s
  scenario: scenario-default

# http://gettaurus.org/docs/ScenarioBuilding/
scenarios:
  scenario-default:
    default-address:
    requests:
    - url: /health
      #think-time: 10
      method: GET
      headers:
        Content-Type: application/json
      assert:
      - contains:
        - UP
        subject: body

reporting:
  - module: final-stats
    dump-xml: scenario-default-security-health-jmeter-stats.xml